UTILIDAD/RECAUDACIONES/RECAUDACION MARGLOBAL/DEV/PRUEBAS/DESARROLLO/SOA.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:otc="http://www.bolivariano.com/ws/OTCService" xmlns:men="http://www.bolivariano.com/mensaje/MensajeOTC">
   <soapenv:Header/>
   <soapenv:Body>
      <otc:entradaConsultarDeuda>
         <men:canal>IBK</men:canal>
         <men:depuracion>N</men:depuracion>
         <men:fecha>2023-10-30T06:29:24.000Z</men:fecha>
         <men:oficina>0</men:oficina>
         <men:secuencial>11020417</men:secuencial>
         <men:servicio>
            <codTipoServicio>PAGO_ADUANA</codTipoServicio>
            <codigoConvenio>22289</codigoConvenio>
            <codigoEmpresa>1929</codigoEmpresa>
            <codigoTipoBanca>BP</codigoTipoBanca>
            <codigoTipoIdentificador>1</codigoTipoIdentificador>
            <datosAdicionales>
               <datoAdicional>
                  <codigo>s_ssn</codigo>
                  <valor>48574009</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_user</codigo>
                  <valor>ope998</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_sesn</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_term</codigo>
                  <valor>term24</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_ofi</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_rol</codigo>
                  <valor>5</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_date</codigo>
                  <valor>2023-10-30T00:00:00.000-05:00</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_srv</codigo>
                  <valor>BOLIVSRV</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_lsrv</codigo>
                  <valor>BOLIVSRV</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_org_err</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_org</codigo>
                  <valor>U</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_error</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_sev</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>s_msg</codigo>
                  <valor></valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>t_debug</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>t_file</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>t_from</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>t_trn</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>o_msj_error</codigo>
                  <valor/>
               </datoAdicional>
            </datosAdicionales>
            <identificador>690380218202310</identificador>
         </men:servicio>
         <men:transaccion>2057</men:transaccion>
         <men:usuario>TcUPI1396206</men:usuario>
      </otc:entradaConsultarDeuda>
   </soapenv:Body>
</soapenv:Envelope>

<!--Response-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns3:salidaConsultarDeuda xmlns:ns2="http://www.bolivariano.com/mensaje/MensajeOTC" xmlns:ns3="http://www.bolivariano.com/ws/OTCService">
         <ns2:codigoError>0</ns2:codigoError>
         <ns2:datosAdicionales>
            <ns2:datoAdicional>
               <codigo>rucempresa</codigo>
               <editable>false</editable>
               <valor>0992156562001</valor>
               <visible>false</visible>
            </ns2:datoAdicional>
         </ns2:datosAdicionales>
         <ns2:formaPago>TOTAL</ns2:formaPago>
         <ns2:mensajeUsuario>OK</ns2:mensajeUsuario>
         <ns2:montoTotal>2768.0</ns2:montoTotal>
         <ns2:nombreCliente>FARLETZA S.A.</ns2:nombreCliente>
      </ns3:salidaConsultarDeuda>
   </soap:Body>
</soap:Envelope>